Revit 2027 API
View.IsFilterApplied Method
 Indicates if a filter is applied to the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFilterApplied(
	ElementId filterElementId
)
Public Function IsFilterApplied (
	filterElementId As ElementId
) As Boolean
public:
bool IsFilterApplied(
	ElementId^ filterElementId
)
member IsFilterApplied :
        filterElementId : ElementId -> bool
Parameters
filterElementId ElementId
 ElementId of the filter.
Return Value
Boolean
 True if the filter is applied to the view, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  ElementId is not associated with a FilterElement.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace